___

<a href='http://www.pieriandata.com'> <img src='../Pierian_Data_Logo.png' /></a>
___

# DataFrames

DataFrames are the workhorse of pandas and are directly inspired by the R programming language. We can think of a DataFrame as a bunch of Series objects put together to share the same index. Let's use pandas to explore this topic!

In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn
np.random.seed(101) # to make sure to get the same numbers
# for first call of function

In [4]:
df = pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0  0.302665  1.693723 -1.706086 -1.159119
1 -0.134841  0.390528  0.166905  0.184502
2  0.807706  0.072960  0.638787  0.329646
3 -0.497104 -0.754070 -0.943406  0.484752
4 -0.116773  1.901755  0.238127  1.996652

In [5]:
df = pd.DataFrame(np.random.randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [8]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split()) # quicker

In [10]:
df # each is a pandas series, dataframe is a bunch of series that share an index

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

## Selection and Indexing

Let's learn the various methods to grab data from a DataFrame

In [11]:
df['W'] # is just a series

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [12]:
type(df['W']) # datafame is just a collection of series with same index

pandas.core.series.Series

In [13]:
df.W # also works but can get confusing with methods like df.max

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [16]:
# Pass a list of column names
df[['W','Z']]

          W         Z
A -0.993263  0.000366
B  1.025984  0.649826
C  2.154846 -0.346419
D  0.147027  1.024810
E -0.925874  0.610478

In [17]:
# SQL Syntax (NOT RECOMMENDED!)
df.W # may get confused with methods that are available

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

DataFrame Columns are just Series

In [18]:
type(df['W'])

pandas.core.series.Series

**Creating a new column:**

In [7]:
df['new'] = df['W'] + df['Y'] # creates a column if you use it as if it already exists

In [8]:
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

** Removing Columns**

In [9]:
df.drop('new',axis=1) # need to specify axes = 1 as by default = 0 which is index that has no new; - 1 refers to columns

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [22]:
# Not inplace unless specified!
df

          W         X         Y         Z       new
A -0.993263  0.196800 -1.136645  0.000366 -2.129908
B  1.025984 -0.156598 -0.031579  0.649826  0.994405
C  2.154846 -0.610259 -0.755325 -0.346419  1.399521
D  0.147027 -0.479448  0.558769  1.024810  0.705796
E -0.925874  1.862864 -1.133817  0.610478 -2.059691

In [10]:
df.drop('new',axis=1,inplace=True)
# axis : {0 or 'index', 1 or 'columns'}, default 0
    # Whether to drop labels from the index (0 or 'index') or
    # columns (1 or 'columns').

In [11]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

Can also drop rows this way:

In [12]:
df.drop('E',axis=0) # axis = 0 is default
# same logic as numpy array 
# try df.shape to see the rows on index 0 and columns on index 1

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

** Selecting Rows**

In [14]:
df.loc['A'] # so not only columns but also rows are series

W   -0.993263
X    0.196800
Y   -1.136645
Z    0.000366
Name: A, dtype: float64

In [16]:
df['W']  # only columns work without loc

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: W, dtype: float64

In [22]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

Or select based off of position instead of label

In [23]:
df.loc['C'] # loc for name ; iloc for numerical

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

In [24]:
df.iloc[2] # index location (0,1,2 ... )

W    2.154846
X   -0.610259
Y   -0.755325
Z   -0.346419
Name: C, dtype: float64

** Selecting subset of rows and columns **

In [ ]:
df.loc['B','Y']

In [ ]:
df.loc[['A','B'],['W','Y']]

### Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [27]:
df

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [28]:
df>0

       W      X      Y      Z
A  False   True  False   True
B   True  False  False   True
C   True  False  False  False
D   True  False   True   True
E  False   True  False   True

In [30]:
booldf = df >0
df[booldf]

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [31]:
df[df>0] # can do it all in one go

          W         X         Y         Z
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [ ]:
df[df['W']>0]
# gets rid of rows where W is not > zero

In [32]:
df[df['Z']<0] # only in row C

          W         X         Y         Z
C  2.154846 -0.610259 -0.755325 -0.346419

In [36]:
resultdf = df[df['W']>0]

In [37]:
resultdf['Y']

B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [38]:
df[df['W']>0]['Y'] # all in one go
# return all columns where W>0 and return x column where this is true

B   -0.031579
C   -0.755325
D    0.558769
Name: Y, dtype: float64

In [40]:
df[df['W']>0][['Y','X']]

          Y         X
B -0.031579 -0.156598
C -0.755325 -0.610259
D  0.558769 -0.479448

In [41]:
# the above returns the same as multiple steps
# simple one line saves up memory 
boolser = df['W']>0
result = df[boolser]
mycols = ['Y','X']
result[mycols]

          Y         X
B -0.031579 -0.156598
C -0.755325 -0.610259
D  0.558769 -0.479448

For two conditions you can use | and & with parenthesis:

In [ ]:
df[(df['W']>0) & (df['Y'] > 1)]  # & not and - Python's regular and cannot take an entire seies into account

# & is ampersand
# or is pipe operator |

## More Index Details

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [ ]:
df

In [51]:
# Reset to default 0,1...n index
df.reset_index() # not inplace by default
# old index becomes a column

  States         W         X         Y         Z
0     CA -0.993263  0.196800 -1.136645  0.000366
1     NY  1.025984 -0.156598 -0.031579  0.649826
2     WY  2.154846 -0.610259 -0.755325 -0.346419
3     OR  0.147027 -0.479448  0.558769  1.024810
4     CO -0.925874  1.862864 -1.133817  0.610478

In [43]:
newind = 'CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [44]:
df['States'] = newind # adds a new column called states to the existing data frame

In [45]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [46]:
df.set_index('States')

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [47]:
df.reset_index() # retains original index and doesnt override it

  index         W         X         Y         Z States
0     A -0.993263  0.196800 -1.136645  0.000366     CA
1     B  1.025984 -0.156598 -0.031579  0.649826     NY
2     C  2.154846 -0.610259 -0.755325 -0.346419     WY
3     D  0.147027 -0.479448  0.558769  1.024810     OR
4     E -0.925874  1.862864 -1.133817  0.610478     CO

In [48]:
df

          W         X         Y         Z States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     NY
C  2.154846 -0.610259 -0.755325 -0.346419     WY
D  0.147027 -0.479448  0.558769  1.024810     OR
E -0.925874  1.862864 -1.133817  0.610478     CO

In [49]:
df.set_index('States',inplace=True)

In [50]:
df

               W         X         Y         Z
States
CA     -0.993263  0.196800 -1.136645  0.000366
NY      1.025984 -0.156598 -0.031579  0.649826
WY      2.154846 -0.610259 -0.755325 -0.346419
OR      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [52]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2'] # 3x G1 and 3x G2 
inside = [1,2,3,1,2,3] # 2x 1,2,3 
hier_index = list(zip(outside,inside)) # cast the zipped value into a list 
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [53]:
hier_index

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [54]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  0.386030  2.084019
   2 -0.376519  0.230336
   3  0.681209  1.035125
G2 1 -0.031160  1.939932
   2 -1.005187 -0.741790
   3  0.187125 -0.732845

Now let's show how to index this!   
For index hierarchy we use df.loc[], if this was on the columns axis, you would just use normal bracket notation df[].  
Calling one level of the index returns the sub-dataframe:

In [55]:
df.loc['G1']

          A         B
1  0.386030  2.084019
2 -0.376519  0.230336
3  0.681209  1.035125

In [56]:
df.loc['G1'].loc[1]
# see below df.xs(['G1',1]) is the same but different Name: (G1, 1), dtype: float64

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [57]:
# careful, the above index is a number, that is not iloc 
df.loc['G1'].iloc[1]

A   -0.376519
B    0.230336
Name: 2, dtype: float64

In [ ]:
df.index.names # none as the index has no names

In [58]:
df.index.names = ['Group','Num'] # assigna a name to the index

In [59]:
df

                  A         B
Group Num
G1    1    0.386030  2.084019
      2   -0.376519  0.230336
      3    0.681209  1.035125
G2    1   -0.031160  1.939932
      2   -1.005187 -0.741790
      3    0.187125 -0.732845

In [65]:
df.loc['G1'].loc[2]['B']

0.23033634359240704

In [61]:
df.xs('G1') # cross section - benefit is to be able to go inside the subindex

            A         B
Num
1    0.386030  2.084019
2   -0.376519  0.230336
3    0.681209  1.035125

In [68]:
df.loc['G1'].loc[1]

A    0.386030
B    2.084019
Name: 1, dtype: float64

In [69]:
df.xs(['G1',1])
# same as df.loc['G1'].loc[1] from above but differnt Name: (G1, 1), dtype: float64

A    0.386030
B    2.084019
Name: (G1, 1), dtype: float64

In [70]:
df.xs(1,level='Num')

             A         B
Group
G1     0.38603  2.084019
G2    -0.03116  1.939932

# Great Job!